app/Models/ModelMasyarakat.php

SELECT *
FROM `masyarakat`
---
    public function AllData()
    {
        return $this->db->table('masyarakat')->get()->getResultArray();

SELECT *
FROM `masyarakat`
WHERE `username` = 'radja'
AND `password` = '123'
---
    public function LoginUser($username, $password)
    {
        return $this->db->table('masyarakat')
            ->where([
                'username' => $username,
                'password' => $password,
            ])->get()->getRowArray();