app/Models/ModelTanggapan.php

SELECT `tanggapan`.`id_tanggapan`, `pengaduan`.`id_pengaduan`, `tanggapan`.`id_pengaduan`, `pengaduan`.`tgl_pengaduan`, `tanggapan`.`tgl_tanggapan`, `pengaduan`.`nik`, `masyarakat`.`nama`, `pengaduan`.`foto`, `pengaduan`.`isi_laporan`, `tanggapan`.`tanggapan`, `tanggapan`.`id_petugas`, `petugas`.`nama_petugas`, `pengaduan`.`status`, `tanggapan`.`status`
FROM `tanggapan`
LEFT JOIN `pengaduan` ON `pengaduan`.`id_pengaduan` = `tanggapan`.`id_pengaduan`
LEFT JOIN `petugas` ON `petugas`.`id_petugas` = `tanggapan`.`id_petugas`
LEFT JOIN `masyarakat` ON `masyarakat`.`nik` = `pengaduan`.`nik`
WHERE `pengaduan`.`nik` = '1111111111111111'
---
    public function AllDataMasyarakat($nik)
    {
        $db = $this->db->table('tanggapan');
        $db->select('tanggapan.id_tanggapan, pengaduan.id_pengaduan, tanggapan.id_pengaduan, pengaduan.tgl_pengaduan, tanggapan.tgl_tanggapan, pengaduan.nik, masyarakat.nama, pengaduan.foto, pengaduan.isi_laporan, tanggapan.tanggapan, tanggapan.id_petugas, petugas.nama_petugas, pengaduan.status, tanggapan.status');
        $db->join('pengaduan', 'pengaduan.id_pengaduan = tanggapan.id_pengaduan', 'left');
        $db->join('petugas', 'petugas.id_petugas = tanggapan.id_petugas', 'left');
        $db->join('masyarakat', 'masyarakat.nik = pengaduan.nik', 'left');
        $db->where(['pengaduan.nik' => $nik]);
        return $db->get()->getResultArray();

SELECT `tanggapan`.`id_tanggapan`, `pengaduan`.`id_pengaduan`, `tanggapan`.`id_pengaduan`, `pengaduan`.`tgl_pengaduan`, `tanggapan`.`tgl_tanggapan`, `pengaduan`.`nik`, `masyarakat`.`nama`, `pengaduan`.`foto`, `pengaduan`.`isi_laporan`, `tanggapan`.`tanggapan`, `tanggapan`.`id_petugas`, `petugas`.`nama_petugas`, `pengaduan`.`status`, `tanggapan`.`status`
FROM `tanggapan`
LEFT JOIN `pengaduan` ON `pengaduan`.`id_pengaduan` = `tanggapan`.`id_pengaduan`
LEFT JOIN `petugas` ON `petugas`.`id_petugas` = `tanggapan`.`id_petugas`
LEFT JOIN `masyarakat` ON `masyarakat`.`nik` = `pengaduan`.`nik`
---
    public function AllDataPetugas()
    {
        $db = $this->db->table('tanggapan');
        $db->select('tanggapan.id_tanggapan, pengaduan.id_pengaduan, tanggapan.id_pengaduan, pengaduan.tgl_pengaduan, tanggapan.tgl_tanggapan, pengaduan.nik, masyarakat.nama, pengaduan.foto, pengaduan.isi_laporan, tanggapan.tanggapan, tanggapan.id_petugas, petugas.nama_petugas, pengaduan.status, tanggapan.status');
        $db->join('pengaduan', 'pengaduan.id_pengaduan = tanggapan.id_pengaduan', 'left');
        $db->join('petugas', 'petugas.id_petugas = tanggapan.id_petugas', 'left');
        $db->join('masyarakat', 'masyarakat.nik = pengaduan.nik', 'left');
        return $db->get()->getResultArray();

INSERT INTO `tanggapan` (`id_pengaduan`, `tgl_tanggapan`, `tanggapan`, `id_petugas`) VALUES ('5', '2023-09-14 07:38:48', 'a', '1')
---
    public function InsertData($data)
    {
        $this->db->table('tanggapan')->insert($data);

UPDATE `tanggapan` SET `id_tanggapan` = '67', `status` = '2'
WHERE `id_tanggapan` = '67'
---
    public function ApplyData($data)
    {
        $this->db->table('tanggapan')->where('id_tanggapan', $data['id_tanggapan'])->update($data);

SELECT `tanggapan`.`id_tanggapan`, `pengaduan`.`id_pengaduan`, `pengaduan`.`tgl_pengaduan`, `tanggapan`.`tgl_tanggapan`, `pengaduan`.`nik`, `masyarakat`.`nama`, `pengaduan`.`foto`, `pengaduan`.`isi_laporan`, `tanggapan`.`tanggapan`, `tanggapan`.`id_petugas`, `petugas`.`nama_petugas`, `pengaduan`.`status`, `tanggapan`.`status`
FROM `tanggapan`
LEFT JOIN `pengaduan` ON `pengaduan`.`id_pengaduan` = `tanggapan`.`id_pengaduan`
LEFT JOIN `petugas` ON `petugas`.`id_petugas` = `tanggapan`.`id_petugas`
LEFT JOIN `masyarakat` ON `masyarakat`.`nik` = `pengaduan`.`nik`
WHERE `tanggapan`.`id_tanggapan` = '3'
---
    public function GenerateLaporan($id_tanggapan)
    {
        $db = $this->db->table('tanggapan')
            ->select('tanggapan.id_tanggapan, pengaduan.id_pengaduan, pengaduan.tgl_pengaduan, tanggapan.tgl_tanggapan, pengaduan.nik, masyarakat.nama, pengaduan.foto, pengaduan.isi_laporan, tanggapan.tanggapan, tanggapan.id_petugas, petugas.nama_petugas, pengaduan.status, tanggapan.status')
            ->join('pengaduan', 'pengaduan.id_pengaduan = tanggapan.id_pengaduan', 'left')
            ->join('petugas', 'petugas.id_petugas = tanggapan.id_petugas', 'left')
            ->join('masyarakat', 'masyarakat.nik = pengaduan.nik', 'left')
            ->where(['tanggapan.id_tanggapan' => $id_tanggapan]);
        return $db->get()->getResultArray();