app/Models/ModelPetugas.php

SELECT *
FROM `petugas`
---
    public function AllData()
    {
        return $this->db->table('petugas')->get()->getResultArray();

SELECT *
FROM `petugas`
WHERE `username` = 'radja'
AND `password` = '123'
---
    public function LoginPetugas($username, $password)
    {
        return $this->db->table('petugas')
            ->where([
                'username' => $username,
                'password' => $password,
            ])->get()->getRowArray();