app/Models/ModelPengaduan.php

SELECT `pengaduan`.`id_pengaduan`, `pengaduan`.`tgl_pengaduan`, `pengaduan`.`nik`, `pengaduan`.`isi_laporan`, `masyarakat`.`nama`, `pengaduan`.`foto`, `pengaduan`.`status`
FROM `pengaduan`
LEFT JOIN `masyarakat` ON `masyarakat`.`nik` = `pengaduan`.`nik`
WHERE `pengaduan`.`nik` = '1234123412341234'
---
    public function AllDataMasyarakat($nik)
    {
        $db = $this->db->table('pengaduan');
        $db->select('pengaduan.id_pengaduan');
        $db->select('pengaduan.tgl_pengaduan');
        $db->select('pengaduan.nik');
        $db->select('pengaduan.isi_laporan');
        $db->select('masyarakat.nama');
        $db->select('pengaduan.foto');
        $db->select('pengaduan.status');
        $db->join('masyarakat', 'masyarakat.nik = pengaduan.nik', 'left'); // Join tabel masyarakat
        $db->where(['pengaduan.nik' => $nik]);
        return $db->get()->getResultArray();

SELECT `pengaduan`.`id_pengaduan`, `pengaduan`.`tgl_pengaduan`, `pengaduan`.`nik`, `pengaduan`.`isi_laporan`, `masyarakat`.`nama`, `pengaduan`.`foto`, `pengaduan`.`status`
FROM `pengaduan`
LEFT JOIN `masyarakat` ON `masyarakat`.`nik` = `pengaduan`.`nik`
---
    public function AllDataPetugas()
    {
        $db = $this->db->table('pengaduan');
        $db->select('pengaduan.id_pengaduan');
        $db->select('pengaduan.tgl_pengaduan');
        $db->select('pengaduan.nik');
        $db->select('pengaduan.isi_laporan');
        $db->select('masyarakat.nama');
        $db->select('pengaduan.foto');
        $db->select('pengaduan.status');
        $db->join('masyarakat', 'masyarakat.nik = pengaduan.nik', 'left'); // Join tabel masyarakat
        return $db->get()->getResultArray();

UPDATE `pengaduan` SET `id_pengaduan` = NULL, `status` = '2'
WHERE `id_pengaduan` IS NULL
---
    public function UpdateStatus($dataa)
    {
        $this->db->table('pengaduan')->where('id_pengaduan', $dataa['id_pengaduan'])->update($dataa);

UPDATE `pengaduan` SET `id_pengaduan` = '10', `nik` = '1111111111111111', `isi_laporan` = 'OSHI GW CAKEP BGT BJIRRRRR', `foto` = '1694764631_f35acd15e4977f6ade7a.png', `status` = '0'
WHERE `id_pengaduan` = '10'
---
    public function UpdateData($data)
    {
        $this->db->table('pengaduan')->where('id_pengaduan', $data['id_pengaduan'])->update($data);

SELECT *
FROM `pengaduan`
WHERE `id_pengaduan` = '10'
---
    public function DeleteData($data)
    {
        $this->db->table('pengaduan')->where('id_pengaduan', $data['id_pengaduan'])->delete($data);